SimpleLinearAutoencoder(
  (encoder): Sequential(
    (0): Linear(in_features=34350, out_features=784, bias=True)
    (1): ReLU(inplace=True)
    (2): Linear(in_features=784, out_features=256, bias=True)
    (3): ReLU(inplace=True)
    (4): Linear(in_features=256, out_features=128, bias=True)
    (5): ReLU(inplace=True)
    (6): Linear(in_features=128, out_features=64, bias=True)
    (7): ReLU(inplace=True)
    (8): Linear(in_features=64, out_features=32, bias=True)
    (9): ReLU(inplace=True)
    (10): Linear(in_features=32, out_features=16, bias=True)
    (11): ReLU(inplace=True)
  )
  (decoder): Sequential(
    (0): Linear(in_features=16, out_features=32, bias=True)
    (1): ReLU(inplace=True)
    (2): Linear(in_features=32, out_features=64, bias=True)
    (3): ReLU(inplace=True)
    (4): Linear(in_features=64, out_features=128, bias=True)
    (5): ReLU(inplace=True)
    (6): Linear(in_features=128, out_features=256, bias=True)
    (7): ReLU(inplace=True)
    (8): Linear(in_features=256, out_features=784, bias=True)
    (9): ReLU(inplace=True)
    (10): Linear(in_features=784, out_features=34350, bias=True)
    (11): ReLU(inplace=True)
  )
)

n_epochs = 20
batch_size = 50
lr = .01
20/20 epochs | loss: 0.00290
criterion = nn.L1Loss()
optimizer = optim.SGD(model.parameters(), lr=lr, momentum=0.9)
output_images:
  1.png
